{
  "kind": "build_request",
  "title": "Update promise reveal button to aesthetic pink and change label text",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-6",
      "text": "Update the additional promise reveal button at the end of the Promise Day greeting card to use an aesthetic pretty/dark pink color styling (including hover/active states) instead of the current coral styling, while keeping the button readable and consistent with the page’s romantic theme.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Make the button pink color, dark pink or a good-looking pretty pink, aesthetic pink"
        ]
      },
      "acceptanceCriteria": [
        "The button background appears as a clearly pink (pretty/dark pink) color in its default state (not coral).",
        "Hover/focus/active states remain within a pink palette (e.g., slightly darker/lighter pink) and maintain sufficient contrast with the button text.",
        "Button styling remains visually consistent with the existing romantic theme and does not introduce a blue/purple-dominant scheme."
      ]
    },
    {
      "id": "REQ-7",
      "text": "Change the user-facing label text on the additional promise reveal button to exactly: \"because we love each other. Click me.\"",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "and write because we love each other. Click me."
        ]
      },
      "acceptanceCriteria": [
        "The button displays exactly this text (including punctuation and capitalization): \"because we love each other. Click me.\""
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (Shadcn components are read-only).",
    "Do not edit immutable hook files listed in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "No backend/Motoko changes.",
    "No changes to the revealed promise message text content."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}