{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Promise Day reveal button pink styling + label text update",
  "requirements": [
    {
      "id": "REQ-6",
      "summary": "Restyle the Promise Day additional promise reveal button to an aesthetic pretty/dark pink (including hover/focus/active) while preserving readability and the romantic theme.",
      "acceptanceCriteria": [
        "The button background appears as a clearly pink (pretty/dark pink) color in its default state (not coral).",
        "Hover/focus/active states remain within a pink palette (e.g., slightly darker/lighter pink) and maintain sufficient contrast with the button text.",
        "Button styling remains visually consistent with the existing romantic theme and does not introduce a blue/purple-dominant scheme."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Introduce/adjust romantic pink color tokens (e.g., CSS variables) and any supporting utility styles needed so the reveal button can use a clearly pink palette across default/hover/focus/active states while keeping good text contrast."
        },
        {
          "path": "frontend/src/pages/PromiseDayPage.tsx",
          "operation": "modify",
          "description": "Update the reveal Button styling classes to replace the current coral styling with the new romantic pink palette, including hover/focus-visible/active states and maintaining readability/romantic consistency. (Do not edit shadcn Button component under frontend/src/components/ui.)"
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Change the additional promise reveal button label text to exactly: \"because we love each other. Click me.\"",
      "acceptanceCriteria": [
        "The button displays exactly this text (including punctuation and capitalization): \"because we love each other. Click me.\""
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/PromiseDayPage.tsx",
          "operation": "modify",
          "description": "Replace the current conditional button label text with the exact required string: \"because we love each other. Click me.\" Ensure the user-facing button text always matches exactly (including punctuation/capitalization) while keeping the existing reveal behavior intact."
        }
      ]
    }
  ]
}